In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a','b','c']

my_data = [10,20,30]
arr = np.array(my_data)

d = {'a':10,'b':20,'c':20}

In [3]:
print('Labels:',labels)
print('My_data:',my_data)
print('Dictionary:',d)

Labels: ['a', 'b', 'c']
My_data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 20}

In [4]:
Series_data= pd.Series(data= my_data, index=labels)

In [5]:
Series_data

a    10
b    20
c    30
dtype: int64

In [6]:
print('\n Holding numerical data\n','-'*25,sep='')
print(pd.Series(arr))

 Holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int64

In [7]:
ser1 = pd.Series([1,2,3,4],['CA','OR','CO','AZ'])
ser2 = pd.Series([1,2,4,5],['CA','OR','NV','AZ'])

In [8]:
print('\nIndexing by name of the item/object (string identifier)\n','-'*56,sep='')
print('Values of CA in ser1:',ser1['CA'])
print('Values of AZ in ser1:',ser1['AZ'])
print('Values of NV in ser1:',ser2['NV'])

Indexing by name of the item/object (string identifier)
--------------------------------------------------------
Values of CA in ser1: 1
Values of AZ in ser1: 4
Values of NV in ser1: 4

In [9]:
ser2[2]

4

In [10]:
print('\nIndexing by number  (positional value in the series)\n','-'*52,sep='')
print('Values of CA in ser1:',ser1[0])
print('Values of AZ in ser1:',ser1[3])
print('Values of NV in ser1:',ser2[2])

Indexing by number  (positional value in the series)
----------------------------------------------------
Values of CA in ser1: 1
Values of AZ in ser1: 4
Values of NV in ser1: 4

In [11]:
print('\nIndexing by a range \n','-'*56,sep='')
print('Value for OR, CO and AZ:\n',ser1[1:4])

Indexing by a range
--------------------------------------------------------
Value for OR, CO and AZ:
 OR    2
CO    3
AZ    4
dtype: int64

In [16]:
ser3 = ser1 + ser2

In [17]:
ser3

AZ    9.0
CA    2.0
CO    NaN
NV    NaN
OR    4.0
dtype: float64

In [18]:
## 1h30 minutes I stopped

In [19]:
from numpy.random import randn as rn

In [21]:
## Generate the same numbers when run it
np.random.seed(101)

matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(data=matrix_data, index=row_labels,columns=column_headings)
print('\nDataframe looks like this\n','-'*45,sep='')
print(df)

Dataframe looks like this
---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [27]:
print("\nThe 'X' column\n",'-'*25,sep='')
print(df['X'])

The 'X' column
-------------------------
A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

## How to check indexes of multiple rows

In [28]:
df.loc['A','Y']

0.9079694464765431

In [30]:
print("\n Subset comprissing rows B and D, and columns W and Y is \n",'-'*25,sep='')
print(df.loc[['B','D'],['W','Y']])

## print the the row B and D with corresponding that in the columns W and Y .

 Subset comprissing rows B and D, and columns W and Y is
-------------------------
          W         Y
B  0.651118 -0.848077
D  0.188695 -0.933237

In [31]:
## using Boolean

print("\nBoolean DataFrame(s) where we checking if the values are greater than 0\n",'-'*75,sep='')
print(df > 0)

Boolean DataFrame(s) where we checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [32]:
### from above command how get real values

boolean_real = df > 0

In [33]:
print(df[boolean_real])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
## second example

booldf1 = df.loc[['A','B','C']] > 0

In [38]:
print(booldf1)

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False

In [39]:
print(df[booldf1])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D       NaN       NaN       NaN       NaN
E       NaN       NaN       NaN       NaN

In [40]:
matrix_data1 = np.matrix('22,66,140;42,70,148;30,62,125;35,68,168;25,62,152')
row_labels1 = ['A','B','C','D','E']
column_headings1 = ['Age','Height','Weight']

In [42]:
df1 = pd.DataFrame(data= matrix_data1,index=row_labels1, columns=column_headings1)
print('\n The new data frame is: \n','-'*25,sep='')
print(df1)

 The new data frame is:
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     168
E   25      62     152

In [47]:
delta_data1 = df1['Height'] > 65

In [49]:
df1[delta_data1]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     168

In [50]:
delta_data2 = df1['Weight'] > 145

In [51]:
delta_data3 = df1[delta_data1 & delta_data2]

In [52]:
delta_data3

   Age  Height  Weight
B   42      70     148
D   35      68     168

In [68]:
### select specific colums base on some conditions


print("\nDataFrame with only Age and Weight columns whose Height greater than 65\n",'-'*71,sep='')
print(df1[delta_data1][['Age','Weight']])

DataFrame with only Age and Weight columns whose Height greater than 65
-----------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     168

In [73]:
df1[delta_data1][['Age','Weight']]

   Age  Weight
A   22     140
B   42     148
D   35     168

## How to used __reset_index()__ method to reset indexes ??

In [75]:
df1

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     168
E   25      62     152

In [77]:
print("\n After resetting the index\n",'-'*35,sep='')
print(df1.reset_index())

 After resetting the index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     168
4     E   25      62     152

In [78]:
## This is used to remove the old indexes

print("\n After resetting the index with 'drop' is TRUE\n",'-'*35,sep='')
print(df1.reset_index(drop=True))

 After resetting the index with 'drop' is TRUE
-----------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     168
4   25      62     152

## Hw to add new colums to the DataFrame using __split()__ method ?

In [79]:
df1['Profession'] = 'Student Teacher Engeneer Doctor Nurse'.split()
df1

   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engeneer
D   35      68     168     Doctor
E   25      62     152      Nurse

## How to used __set_index()__ method ?

In [83]:
##  let use the profession as indexes

df2 = df1.set_index('Profession')

In [82]:
df1

   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engeneer
D   35      68     168     Doctor
E   25      62     152      Nurse

In [84]:
df2

            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engeneer     30      62     125
Doctor       35      68     168
Nurse        25      62     152

'/Users/olivierla412/projects/DataTrained_live_classes'